---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRemainder
source: html/7ea24709-bfe4-7373-2408-32ed8122c28f.htm
---
# Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRemainder Property

Pattern Remainder.

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemSegmentPatternRemainder { get; }
```